using System;
using System.Collections.Generic;
using System.Text;
using UnikktleMentorEngine;

namespace UnikktleMentorEngine
{
	public static class C11職種別適応性判定
	{
		public static void 職種別適応性判定(Gender gender, C02系統値計算_結果 c02結果, C03系統判定_結果 c03系統結果, C07集合因子判定_結果 c07結果, C11職種別適応性判定_結果 c11結果)
		{
			//初期化();

			c11結果.mstr固定_一般職 += "【一般職種別資質判定】" + "<br>";
			c11結果.mstr固定_一般職 += "職種" + "\t" + "資質" + "<br>";
			c11結果.mstr固定_一般職 += "一般事務職" + "\t" + 一般事務職資質(c02結果) + "<br>";
			c11結果.mstr固定_一般職 += "営業職" + "\t" + 営業職資質(c02結果, c03系統結果, c07結果) + "<br>";
			c11結果.mstr固定_一般職 += "労務職" + "\t" + 労務職資質(gender, c02結果, c03系統結果) + "<br>";
			c11結果.mstr固定_一般職 += "サービス職" + "\t" + サービス職資質(c02結果, c03系統結果, c07結果) + "<br>";

			c11結果.mstr固定_専門職 += "【専門職別資質判定】※1" + "<br>";
			c11結果.mstr固定_専門職 += "職種"			+ "\t" + "資質" + "<br>";
			c11結果.mstr固定_専門職 += "プログラマー"	+ "\t" + プログラマー(c02結果)		+ "\t" + "※2：他に、IQが高く、エゴグラムでA因子の値が高いことが望ましい。" + "<br>";
			c11結果.mstr固定_専門職 += "司書"			+ "\t" + 司書(c02結果)				+ "<br>";
			c11結果.mstr固定_専門職 += "広告"			+ "\t" + 広告(c02結果)				+ "\t" + "※3：他に、IQが高く、エゴグラムでFc因子の値が高いことが望ましい。" + "<br>";
			c11結果.mstr固定_専門職 += "バスガイド"	+ "\t" + 観光バスガイド(c02結果)	+ "<br>";
			c11結果.mstr固定_専門職 += "※1：専門職では性格特性よりも経験や技能を重視した方が良い。" + "<br>";

		}



		private static string プログラマー(C02系統値計算_結果 c02結果)
		{
			if (3 < c02結果.標準点Ag_攻撃性 &&
				3 < c02結果.標準点G_活動性 &&
				3 > c02結果.標準点R_のん気 &&
				3 > c02結果.標準点T_思考性)
			{
				if (3 > c02結果.標準点D_抑うつ性 &&
					3 > c02結果.標準点C_気分の変化 &&
					3 > c02結果.標準点I_劣等感 &&
					3 > c02結果.標準点N_神経質 &&
					3 > c02結果.標準点Co_協調性 &&
					3 > c02結果.標準点O_主観性)
				{
					return "○";
				}

				return "△";
			}

			return "";
		}

		private static string 司書(C02系統値計算_結果 c02結果)
		{
			if (3 > c02結果.標準点D_抑うつ性 &&
				3 > c02結果.標準点C_気分の変化 &&
				3 > c02結果.標準点I_劣等感 &&
				3 > c02結果.標準点N_神経質 &&
				3 < c02結果.標準点G_活動性 &&
				3 > c02結果.標準点R_のん気 &&
				3 > c02結果.標準点T_思考性)
			{
				if (c02結果.標準点Co_協調性 > c02結果.標準点A_支配性 &&
					c02結果.標準点Co_協調性 > c02結果.標準点S_社会性 &&
					c02結果.標準点O_主観性 > c02結果.標準点A_支配性 &&
					c02結果.標準点O_主観性 > c02結果.標準点S_社会性)
				{
					return "○";
				}

				return "△";
			}

			return "";
		}

		private static string 広告(C02系統値計算_結果 c02結果)
		{
			if (c02結果.標準点C_気分の変化 > c02結果.標準点D_抑うつ性 &&
				c02結果.標準点C_気分の変化 > c02結果.標準点I_劣等感 &&
				c02結果.標準点C_気分の変化 > c02結果.標準点N_神経質 &&
				c02結果.標準点C_気分の変化 > c02結果.標準点Co_協調性 &&
				c02結果.標準点O_主観性 > c02結果.標準点D_抑うつ性 &&
				c02結果.標準点O_主観性 > c02結果.標準点I_劣等感 &&
				c02結果.標準点O_主観性 > c02結果.標準点N_神経質 &&
				c02結果.標準点O_主観性 > c02結果.標準点Co_協調性)
			{
				if (3 < c02結果.標準点Ag_攻撃性 &&
					3 < c02結果.標準点G_活動性 &&
					3 < c02結果.標準点A_支配性 &&
					3 < c02結果.標準点S_社会性)
				{
					return "○";
				}

				return "△";
			}

			return "";
		}

		private static string 観光バスガイド(C02系統値計算_結果 c02結果)
		{
			if (c02結果.標準点C_気分の変化 > c02結果.標準点D_抑うつ性 &&
				c02結果.標準点C_気分の変化 > c02結果.標準点I_劣等感 &&
				c02結果.標準点C_気分の変化 > c02結果.標準点N_神経質 &&
				c02結果.標準点C_気分の変化 > c02結果.標準点Co_協調性 &&
				c02結果.標準点O_主観性 > c02結果.標準点D_抑うつ性 &&
				c02結果.標準点O_主観性 > c02結果.標準点I_劣等感 &&
				c02結果.標準点O_主観性 > c02結果.標準点N_神経質 &&
				c02結果.標準点O_主観性 > c02結果.標準点Co_協調性)
			{
				if (3 < c02結果.標準点R_のん気 &&
					3 < c02結果.標準点T_思考性 &&
					3 < c02結果.標準点A_支配性 &&
					3 < c02結果.標準点S_社会性)
				{
					return "○";
				}

				return "△";
			}

			return "";
		}



		private static string 一般事務職資質(C02系統値計算_結果 c02結果)
		{
			if ((1 <= c02結果.標準点O_主観性 && c02結果.標準点O_主観性 <= 2) &&
				(1 <= c02結果.標準点Co_協調性 && c02結果.標準点Co_協調性 <= 2))
			{
				if ((2 <= c02結果.標準点D_抑うつ性 && c02結果.標準点D_抑うつ性 <= 3) &&
					(2 <= c02結果.標準点C_気分の変化 && c02結果.標準点C_気分の変化 <= 3) &&
					(2 <= c02結果.標準点I_劣等感 && c02結果.標準点I_劣等感 <= 3) &&
					(2 <= c02結果.標準点N_神経質 && c02結果.標準点N_神経質 <= 3))
				{
					if ((3 <= c02結果.標準点Ag_攻撃性 && c02結果.標準点Ag_攻撃性 <= 4) &&
						(3 <= c02結果.標準点G_活動性 && c02結果.標準点G_活動性 <= 4))
					{
						return "◎";
					}

					return "○";
				}

				return "△";
			}

			return "";
		}

		private static string 営業職資質(C02系統値計算_結果 c02結果, C03系統判定_結果 c03系統結果, C07集合因子判定_結果 c07結果)
		{
			if (c03系統結果.mstr系統コード.IndexOf("A類") > -1)
			{
				return A型セールスマン(c02結果, c07結果);
			}
			else if (c03系統結果.mstr系統コード.IndexOf("B類") > -1)
			{
				return B型セールスマン(c02結果, c07結果);
			}
			else if (c03系統結果.mstr系統コード.IndexOf("D類") > -1)
			{
				return D型セールスマン(c02結果, c07結果);
			}

			return "";
		}

		private static string 労務職資質(Gender gender, C02系統値計算_結果 c02結果, C03系統判定_結果 c03系統結果)
		{
			if (gender == Gender.Male &&
				c03系統結果.mstr系統コード.IndexOf("E類") > -1)
				return "";

			if ((1 <= c02結果.標準点O_主観性 && c02結果.標準点O_主観性 <= 2) &&
				(1 <= c02結果.標準点Co_協調性 && c02結果.標準点Co_協調性 <= 2) &&
				(2 <= c02結果.標準点Ag_攻撃性 && c02結果.標準点Ag_攻撃性 <= 3) &&
				(c02結果.標準点G_活動性 > c02結果.標準点R_のん気) &&
				(c02結果.標準点G_活動性 > c02結果.標準点T_思考性))
			{
				return "○";
			}

			if (5 > c02結果.標準点O_主観性 &&
				5 > c02結果.標準点Co_協調性 &&
				5 > c02結果.標準点Ag_攻撃性)
			{
				return "△";
			}

			return "";
		}

		private static string サービス職資質(C02系統値計算_結果 c02結果, C03系統判定_結果 c03系統結果, C07集合因子判定_結果 c07結果)
		{
			if (c03系統結果.mstr系統コード.IndexOf("B類") > -1)
			{
				return B型サービス職(c02結果);
			}
			else if (c03系統結果.mstr系統コード.IndexOf("D類") > -1)
			{
				return D型サービス職(c02結果);
			}
			else
			{
				if (c07結果.mstr情緒安定性 != "不安定" &&
				    c07結果.mstr社会適応性 == "普通" &&
				    c07結果.mstr活動性 != "積極行動不一致型" &&
				    c07結果.mstr内省性 != "優柔不断型" &&
				    c07結果.mstr社交性 != "非社交的")
					return "○";
			}

			return "";
		}

		private static string B型サービス職(C02系統値計算_結果 c02結果)
		{
			if (4 >= c02結果.標準点D_抑うつ性 &&
				4 >= c02結果.標準点C_気分の変化 &&
				4 >= c02結果.標準点I_劣等感 &&
				4 >= c02結果.標準点N_神経質 &&
				4 >= c02結果.標準点O_主観性 &&
				4 >= c02結果.標準点Co_協調性 &&
				(3 <= c02結果.標準点Ag_攻撃性 && c02結果.標準点Ag_攻撃性 <= 4) &&
				(3 <= c02結果.標準点G_活動性 && c02結果.標準点G_活動性 <= 4) &&
				(4 <= c02結果.標準点A_支配性 && c02結果.標準点A_支配性 <= 5) &&
				(4 <= c02結果.標準点S_社会性 && c02結果.標準点S_社会性 <= 5))
			{
				if ((c02結果.標準点G_活動性 + 1) < c02結果.標準点R_のん気 &&
					(c02結果.標準点G_活動性 + 1) < c02結果.標準点T_思考性)
					return "△";
				else
					return "○";
			}

			return "";
		}

		private static string D型サービス職(C02系統値計算_結果 c02結果)
		{
			if (C00Common.ChkDCINで突出がある(c02結果) == true)
				return "";

			if ((1 <= c02結果.標準点O_主観性 && c02結果.標準点O_主観性 <= 2) &&
				(1 <= c02結果.標準点Co_協調性 && c02結果.標準点Co_協調性 <= 2) &&
				(3 <= c02結果.標準点Ag_攻撃性 && c02結果.標準点Ag_攻撃性 <= 4) &&
				(3 <= c02結果.標準点G_活動性 && c02結果.標準点G_活動性 <= 4) &&
				(4 <= c02結果.標準点A_支配性 && c02結果.標準点A_支配性 <= 5) &&
				(4 <= c02結果.標準点S_社会性 && c02結果.標準点S_社会性 <= 5))
			{
				if ((c02結果.標準点G_活動性 + 1) < c02結果.標準点R_のん気 &&
					(c02結果.標準点G_活動性 + 1) < c02結果.標準点T_思考性)
					return "△";
				else
					return "○";
			}

			return "△";
		}

		private static string A型セールスマン(C02系統値計算_結果 c02結果, C07集合因子判定_結果 c07結果)
		{
			//if (C00Common.ChkDCINで突出がある() == true)
			//    return "";
			if (0 <= c07結果.mstr情緒安定性.IndexOf("不安定"))
				return "";

			if (3 < c02結果.標準点Co_協調性)
				return "";

			if (3 != c02結果.標準点G_活動性)
				return "";

			if (4 > c02結果.標準点A_支配性)
				return "";

			if (4 > c02結果.標準点S_社会性)
				return "";

			if (1 == c02結果.標準点R_のん気 ||
				5 == c02結果.標準点R_のん気)
				return "";

			if (1 == c02結果.標準点T_思考性 ||
				5 == c02結果.標準点T_思考性)
				return "";

			if (c07結果.mstr共感性.IndexOf("高い") > -1)
				return "◎";
			else
				return "○";
		}

		private static string B型セールスマン(C02系統値計算_結果 c02結果, C07集合因子判定_結果 c07結果)
		{
			if (4 < c02結果.標準点D_抑うつ性 ||
				4 < c02結果.標準点C_気分の変化 ||
				4 < c02結果.標準点I_劣等感 ||
				4 < c02結果.標準点N_神経質 ||
				4 < c02結果.標準点O_主観性 ||
				4 < c02結果.標準点Co_協調性)
				return "";

			if (3 != c02結果.標準点G_活動性)
				return "";

			if (4 > c02結果.標準点A_支配性)
				return "";

			if (4 > c02結果.標準点S_社会性)
				return "";

			if (c02結果.標準点G_活動性 < c02結果.標準点R_のん気 ||
				c02結果.標準点G_活動性 < c02結果.標準点T_思考性)
				return "";

			if (c07結果.mstr共感性.IndexOf("高い") > -1)
				return "◎";
			else
				return "○";
		}

		private static string D型セールスマン(C02系統値計算_結果 c02結果, C07集合因子判定_結果 c07結果)
		{
			if (C00Common.ChkDCINで突出がある(c02結果) == true)
				return "";

			if (4 <= c02結果.標準点Co_協調性)
				return "";

			if (3 != c02結果.標準点G_活動性)
				return "";

			if (4 > c02結果.標準点A_支配性)
				return "";

			if (4 > c02結果.標準点S_社会性)
				return "";

			if (1 == c02結果.標準点R_のん気 ||
				5 == c02結果.標準点R_のん気)
				return "";

			if (1 == c02結果.標準点T_思考性 ||
				5 == c02結果.標準点T_思考性)
				return "";

			if (c07結果.mstr共感性.IndexOf("高い") > -1)
				return "◎";
			else
				return "○";
		}



		//private static bool ChkDCINで突出がある()
		//{
		//    int i最大値 = c02結果.mi標準点D;
		//    int i最小値 = c02結果.mi標準点D;

		//    if (i最大値 < c02結果.mi標準点C)
		//        i最大値 = c02結果.mi標準点C;
		//    else if (i最小値 > c02結果.mi標準点C)
		//        i最小値 = c02結果.mi標準点C;

		//    if (i最大値 < c02結果.mi標準点I)
		//        i最大値 = c02結果.mi標準点I;
		//    else if (i最小値 > c02結果.mi標準点I)
		//        i最小値 = c02結果.mi標準点I;

		//    if (i最大値 < c02結果.mi標準点N)
		//        i最大値 = c02結果.mi標準点N;
		//    else if (i最小値 > c02結果.mi標準点N)
		//        i最小値 = c02結果.mi標準点N;

		//    if (1 < (i最大値 - i最小値))
		//        return true;

		//    return false;
		//}


	}
}
